# DetailNurbSpline Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DetailNurbSpline Class
Members See Also
---
Represents a DetailNurbSpline within Autodesk Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class DetailNurbSpline : DetailCurve
```

Visual Basic
---
```text
Public Class DetailNurbSpline _
	Inherits DetailCurve
```

Visual C++
---
```text
public ref class DetailNurbSpline : public DetailCurve
```

# Remarks
Currently it's just a place holder for specific type. All the geometry-related functionality is provided by geometry curve object from DetailCurve::geometryCurve property.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..CurveElement Autodesk.Revit.DB..::..DetailCurve Autodesk.Revit.DB..::..DetailNurbSpline
# See Also
DetailNurbSpline Members
Autodesk.Revit.DB Namespace